## Pandas

In [ ]:
import pandas as pd
import numpy as np
# pd is just an alias for the library

In [ ]:
data = pd.DataFrame({'Country': ['Russia','Colombia','Chile','Equador','Nigeria'],
                    'Rank':[121,40,100,130,11]})
data

In [ ]:
data.sort_values(by = 'Rank')

In [ ]:
data = pd.DataFrame({'k1':['one']*3 + ['two']*4, 'k2':[3,2,1,3,3,4,4]})
data

In [ ]:
data.drop_duplicates()
# data.drop_duplicates(subset='k1')

In [ ]:
# applying functions

def funct(x):
    return x *2

funct = lambda x:x*2

data['k2'] = data['k2'].apply(funct)
data

In [ ]:
# TIP
funct = lambda x,y:x*2+y
funct(1,2)

In [ ]:
print(data.drop('k2' , axis = 1))
data

In [ ]:
# Drop Null Values
# excersise

In [ ]:
data['k1'].unique()

In [ ]:
pd.value_counts(data['k1'])

In [48]:
# do groupby
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -1.980957 -1.531612
1    a  two  1.002492 -0.697629
2    b  one  0.098380  0.666221
3    b  two -2.398206  1.532260
4    a  one -0.604024  1.720149

In [ ]:
df.groupby('key2').median()

In [ ]:
df.info()

In [ ]:
df.describe()

In [ ]:
# slicing
df[:3]

In [ ]:
df[:3 , :1]

In [47]:
df.iloc[:3 , :1]

  key1
0    a
1    a
2    b

In [50]:
df.query('data1 < data2')

  key1 key2     data1     data2
0    a  one -1.980957 -1.531612
2    b  one  0.098380  0.666221
3    b  two -2.398206  1.532260
4    a  one -0.604024  1.720149

In [57]:
df[df.data1 < df.data2]
# try the list

  key1 key2     data1     data2
0    a  one -1.980957 -1.531612
2    b  one  0.098380  0.666221
3    b  two -2.398206  1.532260
4    a  one -0.604024  1.720149

In [58]:
iris = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv')

In [60]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [61]:
# INFO and Description

In [62]:
# groupby based on species

In [63]:
# find unique

In [64]:
# add new column adding two columns

In [65]:
# apply normalization on all